/*
*All rights reserved.
*文件名称：main.c
*完成日期：2019/03/10
*版 本 号：v1.0
*问题描述：有一对兔子, 从出生后第三个月起每个月都生一对兔子, 小兔子长到第三个月后每个月又生一对兔子, 假如兔子都不死, 每个月的兔子总数为多少?
*程序输出：该月份的兔子总数
*/
#include <stdio.h>
#include<math.h>


int main() {
	int sum=1, m[20];
	m[1] = m[0] = 1;
	for (int i = 0; i < 12; i++) {
		if (i == 0 || i == 1)
			printf("第%d个月的兔子总数为%d对\n", i+1, m[i]);
		else {
			m[i] = m[i - 1] + m[i - 2];
			printf("第%d个月的兔子总数为%d对\n", i+1, m[i]);
		}
	}

}
//根据题找到规律  1对,  1对,  2对,  3, 5, 8, 13, 21......可以发现从第三个月起  后一个月是前两个月兔子总数的和.
